CarpeNecopinum/nRFWatch/variants/sma_q3/variant.h
/*
  Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
  Copyright (c) 2016 Sandeep Mistry All right reserved.
  This library is free software; you can redistribute it and/or
  modify it under the terms of the GNU Lesser General Public
  License as published by the Free Software Foundation; either
  version 2.1 of the License, or (at your option) any later version.
  This library is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
  See the GNU Lesser General Public License for more details.
  You should have received a copy of the GNU Lesser General Public
  License along with this library; if not, write to the Free Software
  Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA
*/

#ifndef _VARIANT_NRF52_DK_
#define _VARIANT_NRF52_DK_

/** Master clock frequency */
#define VARIANT_MCK (64000000ul)

/*----------------------------------------------------------------------------
 *        Headers
 *----------------------------------------------------------------------------*/

#include "WVariant.h"

#ifdef __cplusplus
extern "C"
{
#endif // __cplusplus

// Number of pins defined in PinDescription array
#define PINS_COUNT (48u)
#define NUM_DIGITAL_PINS (48u)
#define NUM_ANALOG_INPUTS (8u)
#define NUM_ANALOG_OUTPUTS (0u)

// LEDs
#define PIN_LED1 (6)
#define PIN_LED2 (7)
#define PIN_LED3 (8)
#define PIN_LED4 (9)
#define LED_BUILTIN PIN_LED1

// Buttons
#define PIN_BUTTON1 (2)
#define PIN_BUTTON2 (3)
#define PIN_BUTTON3 (4)
#define PIN_BUTTON4 (5)

/*
 * Analog pins
 */
#define PIN_A0 (14)
#define PIN_A1 (15)
#define PIN_A2 (16)
#define PIN_A3 (17)
#define PIN_A4 (18)
#define PIN_A5 (19)
#define PIN_A6 (20) /* AIN3 (P0.05)        */
#define PIN_A7 (21) /* AIN0 (P0.02) / AREF */

    static const uint8_t A0 = PIN_A0; // AIN1
    static const uint8_t A1 = PIN_A1; // AIN2
    static const uint8_t A2 = PIN_A2; // AIN4
    static const uint8_t A3 = PIN_A3; // AIN5
    static const uint8_t A4 = PIN_A4; // AIN6
    static const uint8_t A5 = PIN_A5; // AIN7
    static const uint8_t A6 = PIN_A6; // AIN3 (P0.05)
    static const uint8_t A7 = PIN_A7; // AIN0 (P0.02) / AREF
#define ADC_RESOLUTION 14

// Other pins
#define PIN_AREF (21)
    static const uint8_t AREF = PIN_AREF;

/*
 * Serial interfaces
 */
// Serial - connected to the GPS
#define PIN_SERIAL_RX (30)
#define PIN_SERIAL_TX (31)

/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1

#define PIN_SPI_MISO (28)
#define PIN_SPI_MOSI (27)
#define PIN_SPI_SCK (26)

    static const uint8_t SS = 10;
    static const uint8_t MOSI = PIN_SPI_MOSI;
    static const uint8_t MISO = PIN_SPI_MISO;
    static const uint8_t SCK = PIN_SPI_SCK;

/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 1

#define PIN_WIRE_SDA (33u)
#define PIN_WIRE_SCL (34u)

    static const uint8_t SDA = PIN_WIRE_SDA;
    static const uint8_t SCL = PIN_WIRE_SCL;

/*
 * Reset Button at P0.21
 */
#define RESET_PIN 21

#ifdef __cplusplus
}
#endif

/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#endif
